from book_class import Book
import unittest
class Test_book_class(unittest.TestCase):
   def test_book_str(self):
      book1 = Book("Гарри Поттер и Рона съели слизняки", "Дж К Роулинг", 1999, "супер-фэнтези", "978-0-13-148410-1")
      self.assertEqual(book1.__str__(), "\"Гарри Поттер и Рона съели слизняки\" - Дж К Роулинг, 1999г. супер-фэнтези ISBN: 978-0-13-148410-1")

   def test_book_repr(self):
      book1 = Book("Гарри Поттер и Рона съели слизняки", "Дж К Роулинг", 1999, "супер-фэнтези", "978-0-13-148410-1")
      self.assertEqual(book1.__repr__(), "Book: Гарри Поттер и Рона съели слизняки, author: Дж К Роулинг, year: 1999, genre: супер-фэнтези, isbn: 978-0-13-148410-1")

   def test_book_str_2(self):
      book2 = Book("Гарри Поттер и Венгардиум Левиоса, а не Левиоса", "Дж Роулинг", 2000, "маггл-фэнтези", "365-1-14-201092-3")
      self.assertEqual(book2.__str__(), "\"Гарри Поттер и Венгардиум Левиоса, а не Левиоса\" - Дж Роулинг, 2000г. маггл-фэнтези ISBN: 365-1-14-201092-3")

   def test_book_repr_2(self):
      book2 = Book("Гарри Поттер и Венгардиум Левиоса, а не Левиоса", "Дж Роулинг", 2000, "маггл-фэнтези", "365-1-14-201092-3")
      self.assertEqual(book2.__repr__(), "Book: Гарри Поттер и Венгардиум Левиоса, а не Левиоса, author: Дж Роулинг, year: 2000, genre: маггл-фэнтези, isbn: 365-1-14-201092-3")
